docs/modules/help/freemacs-help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Help Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Help Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6d27d21">1. Helpful</a></li>
<li><a href="#orgb1be1dd">2. Popper</a>
<ul>
<li><a href="#orgb8f6e62">2.1. Popper Buffers</a></li>
</ul>
</li>
<li><a href="#orgf9fcf03">3. Which-key</a>
<ul>
<li><a href="#org2b57a3a">3.1. Activating Which-key</a>
<ul>
<li><a href="#org6130ee6">3.1.1. C-h During Key Combination Entry</a></li>
<li><a href="#orgea041d2">3.1.2. Press &lt;f4&gt; in Any Mode</a></li>
</ul>
</li>
<li><a href="#orgd360063">3.2. Which-key Window Location</a></li>
</ul>
</li>
<li><a href="#orgc64a03a">4. End</a></li>
</ul>
</div>
</div>



<div id="outline-container-org6d27d21" class="outline-2">
<h2 id="org6d27d21"><span class="section-number-2">1.</span> Helpful</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/Wilfred/helpful">Helpful</a> improves the Emacs help functions by adding new features to the <code>*Help*</code> buffers such as:
</p>

<ul class="org-ul">
<li>Links to source code</li>
<li>Better formatting of docstrings</li>
<li>Lists of callers</li>
<li>Keymaps</li>
<li>Aliases</li>
<li>And more&#x2026;</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">helpful</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:bind</span>
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"C-h f"</span> . #'helpful-callable<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"C-h v"</span> . #'helpful-variable<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"C-h k"</span> . #'helpful-key<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"C-c C-d"</span> . #'helpful-at-point<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"C-h F"</span> . #'helpful-function<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"C-h C"</span> . #'helpful-command<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1be1dd" class="outline-2">
<h2 id="orgb1be1dd"><span class="section-number-2">2.</span> Popper</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/karthink/popper">Popper</a> lets a user define any window as a short-term pop up window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">popper</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:bind</span> <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-`"</span>   . popper-toggle-latest<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-`"</span>   . popper-cycle<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-M-`"</span> . popper-toggle-type<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> popper-reference-buffers
          '<span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"\\*Messages\\*"</span>
            <span style="color: #7984D1;">"\\*Embark Actions\\*"</span>
            <span style="color: #7984D1;">"Output\\*$"</span>
            <span style="color: #7984D1;">"\\*Async Shell Command\\*"</span>
            <span style="color: #7984D1;">"\\*Whicher Report\\*"</span>
            help-mode
            compilation-mode<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>popper-mode +1<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>popper-echo-mode +1<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgb8f6e62" class="outline-3">
<h3 id="orgb8f6e62"><span class="section-number-3">2.1.</span> Popper Buffers</h3>
<div class="outline-text-3" id="text-2-1">
<p>
For each buffer that will become a popper pop up buffer, it must be defined below:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> popper-reference-buffers
        '<span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"\\*Messages\\*"</span>
          <span style="color: #7984D1;">"\\*Embark Actions\\*"</span>
          <span style="color: #7984D1;">"Output\\*$"</span>
          <span style="color: #7984D1;">"\\*Async Shell Command\\*"</span>
          <span style="color: #7984D1;">"\\*Whicher Report\\*"</span>
          help-mode
          compilation-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9fcf03" class="outline-2">
<h2 id="orgf9fcf03"><span class="section-number-2">3.</span> Which-key</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/justbur/emacs-which-key">Which-key</a> provides a pop-up menu when there is a pause in the minibuffer or if executed directly to show the keyboard commands available to the current buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">which-key</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> 3
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>which-key-show-early-on-C-h t<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>global-set-key <span style="color: #a7da1e;">(</span>kbd <span style="color: #7984D1;">"&lt;f4&gt;"</span><span style="color: #a7da1e;">)</span> 'which-key-show-major-mode<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>which-key-setup-side-window-right-bottom<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>which-key-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org2b57a3a" class="outline-3">
<h3 id="org2b57a3a"><span class="section-number-3">3.1.</span> Activating Which-key</h3>
<div class="outline-text-3" id="text-3-1">
<p>
How to start which-key
</p>
</div>

<div id="outline-container-org6130ee6" class="outline-4">
<h4 id="org6130ee6"><span class="section-number-4">3.1.1.</span> C-h During Key Combination Entry</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Type C-h during any key combination to pop-up which key
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>which-key-show-early-on-C-h t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea041d2" class="outline-4">
<h4 id="orgea041d2"><span class="section-number-4">3.1.2.</span> Press &lt;f4&gt; in Any Mode</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Use the &lt;f4&gt; key in any major mode to see the key bindings
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>global-set-key <span style="color: #ff2afc;">(</span>kbd <span style="color: #7984D1;">"&lt;f4&gt;"</span><span style="color: #ff2afc;">)</span> 'which-key-show-major-mode<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd360063" class="outline-3">
<h3 id="orgd360063"><span class="section-number-3">3.2.</span> Which-key Window Location</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Set up which-key to use the side window preferably
</p>

<div class="org-src-container">
<pre class="src src-nnemacs-lisp">(which-key-setup-side-window-right-bottom)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc64a03a" class="outline-2">
<h2 id="orgc64a03a"><span class="section-number-2">4.</span> End</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-help</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-help.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 12:43&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
